# Connectin Jupyter with databse

In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

# Information on the tables

In [3]:
%%%sql
SELECT * FROM sqlite_master WHERE type='table'

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [6]:
%%%sql
SELECT * FROM facts
LIMIT 5

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [7]:
%%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth) FROM facts

Done.

[(0, 7256490011, 0.0, 4.02)]

In [11]:
%%%sql 
SELECT name, population min_population FROM facts 
WHERE population=(SELECT MIN(population) FROM facts);

Done.

[('Antarctica', 0)]

In [12]:
%%%sql
SELECT name, 
       population min_population 
    FROM facts 
WHERE population=(SELECT MAX(population) FROM facts);

Done.

[('World', 7256490011)]

In [14]:
%%%sql
SELECT AVG(population), AVG(area) FROM facts

Done.

[(62094928.32231405, 555093.546184739)]

In [22]:
%%%sql
SELECT * FROM facts
WHERE area < (SELECT AVG(area) FROM facts) AND population > (Select AVG(population) FROM facts);

Done.

[('Bangladesh',),
 ('Germany',),
 ('Japan',),
 ('Philippines',),
 ('Thailand',),
 ('United Kingdom',),
 ('Vietnam',)]

In [25]:
%%%sql
SELECT name, 
       ROUND(CAST(area_water as Float)/CAST(area_land as Float), 2) AS water_to_land 
    FROM facts
GROUP BY water_to_land
ORDER BY water_to_land DESC
LIMIT 5

Done.

[('British Indian Ocean Territory', 905.67),
 ('Virgin Islands', 4.52),
 ('Puerto Rico', 0.55),
 ('Bahamas, The', 0.39),
 ('Guinea-Bissau', 0.28)]

In [17]:
%%%sql
SELECT name, area_water, area_land FROM facts
WHERE area_water > area_land

Done.

[('British Indian Ocean Territory', 54340, 60), ('Virgin Islands', 1564, 346)]

In [18]:
%%%sql
SELECT name, 
       population_growth 
    FROM facts
GROUP BY population_growth
ORDER BY population_growth DESC
LIMIT 5

Done.

[('South Sudan', 4.02),
 ('Malawi', 3.32),
 ('Burundi', 3.28),
 ('Niger', 3.25),
 ('Uganda', 3.24)]

In [23]:
%%%sql
SELECT name, 
       ROUND(death_rate - birth_rate, 2) AS deaths_over_births 
    FROM facts
WHERE deaths_over_births > 0
ORDER BY deaths_over_births DESC;

Done.

[('Bulgaria', 5.52),
 ('Serbia', 4.58),
 ('Latvia', 4.31),
 ('Lithuania', 4.17),
 ('Ukraine', 3.74),
 ('Hungary', 3.57),
 ('Germany', 2.95),
 ('Slovenia', 2.95),
 ('Romania', 2.76),
 ('Croatia', 2.73),
 ('Belarus', 2.66),
 ('Monaco', 2.59),
 ('Greece', 2.43),
 ('Saint Pierre and Miquelon', 2.3),
 ('Russia', 2.09),
 ('Estonia', 1.89),
 ('Portugal', 1.75),
 ('Japan', 1.58),
 ('Italy', 1.45),
 ('Bosnia and Herzegovina', 0.88),
 ('Czech Republic', 0.71),
 ('Moldova', 0.59),
 ('Poland', 0.45),
 ('Austria', 0.01)]